In [3]:
import pandas as pd

import numpy as np

In [20]:
d = {'one':pd.Series([1,2,3],index= ['a','b','c']),
    'two':pd.Series ([1,2,3,4],index = ['a','b','c','d'])}

df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [21]:
print(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [24]:
df['three']=pd.Series([10,20,30],index=['a','b','c'])
print (df)

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [25]:
df['four']=df['one']+df['three']
print(df)

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [26]:
del df['one']
print(df)

   two  three  four
a    1   10.0  11.0
b    2   20.0  22.0
c    3   30.0  33.0
d    4    NaN   NaN

In [32]:
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
print(df)

   a  b
0  1  2
1  3  4

In [33]:
d={'Name':pd.Series(['Pranay','Swapnil','Ayush','Viraj','Bhusan','Ashwin','Vishal']),
  'Age':pd.Series([25,26,25,30,29,33]),
  'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
print(d)

{'Name': 0     Pranay
1    Swapnil
2      Ayush
3      Viraj
4     Bhusan
5     Ashwin
6     Vishal
dtype: object, 'Age': 0    25
1    26
2    25
3    30
4    29
5    33
dtype: int64, 'Rating': 0    4.23
1    3.24
2    3.98
3    2.56
4    3.20
5    4.60
6    3.80
dtype: float64}

In [34]:
print(df.T)

   0  1
a  1  3
b  2  4

In [35]:
print(df.axes)

[RangeIndex(start=0, stop=2, step=1), Index(['a', 'b'], dtype='object')]

In [36]:
print(df.dtypes)

a    int64
b    int64
dtype: object

In [37]:
print(df.size)

4

In [38]:
print(df.head(2))

   a  b
0  1  2
1  3  4

In [39]:
print(df.ndim)

2

In [40]:
print(df.shape)

(2, 2)

In [41]:
print(df.values)

[[1 2]
 [3 4]]

In [42]:
print(df.tail(2))

   a  b
0  1  2
1  3  4

In [43]:
obj= pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [44]:
obj2= obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [46]:
obj3=pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [47]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [48]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [49]:
obj3.reindex(range(6),method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [56]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Nagpur','Raipur','Hyderabad'])
print(frame)

   Nagpur  Raipur  Hyderabad
a       0       1          2
c       3       4          5
d       6       7          8

In [58]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Nagpur  Raipur  Hyderabad
a     0.0     1.0        2.0
b     NaN     NaN        NaN
c     3.0     4.0        5.0
d     6.0     7.0        8.0

In [59]:
states = ['Raipur','Indore','Hyderabad']
frame.reindex(columns=states)

   Raipur  Indore  Hyderabad
a       1     NaN          2
c       4     NaN          5
d       7     NaN          8

In [60]:
frame.reindex(index=['a','b','c','d'],columns=states)

   Raipur  Indore  Hyderabad
a     1.0     NaN        2.0
b     NaN     NaN        NaN
c     4.0     NaN        5.0
d     7.0     NaN        8.0

In [61]:
obj = pd.Series(np.arange(5), index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [63]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [64]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: int32

In [65]:
data = pd.DataFrame(np.arange(16).reshape(4,4),index=['Nagpur','Raipur','Hyderabad','Indore'],columns=['one','two','three','four'])
data

           one  two  three  four
Nagpur       0    1      2     3
Raipur       4    5      6     7
Hyderabad    8    9     10    11
Indore      12   13     14    15

In [66]:
data.drop(['Raipur','Nagpur'])

           one  two  three  four
Hyderabad    8    9     10    11
Indore      12   13     14    15

In [67]:
data.drop('two',axis=1)

           one  three  four
Nagpur       0      2     3
Raipur       4      6     7
Hyderabad    8     10    11
Indore      12     14    15

In [68]:
data.drop(['two','four'],axis = 'columns')

           one  three
Nagpur       0      2
Raipur       4      6
Hyderabad    8     10
Indore      12     14

In [69]:
df1=pd.DataFrame(np.arange(12).reshape(3,4),columns=list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [70]:
df2=pd.DataFrame(np.arange(20).reshape(4,5),columns=list('abcde'))
df2.loc[1,'b']=np.nan
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [71]:
df1.add(df1,fill_value=0)

    a   b   c   d
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22

In [72]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [4]:
obj=pd.Series(range(4),index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [5]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [7]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [8]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [9]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [12]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [13]:
obj=pd.Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [14]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [16]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [18]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [19]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [21]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [22]:
obj.rank(ascending=False,method='min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [23]:
frame=pd.DataFrame({'b':[4.3,7,-3,2],
                   'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [25]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [27]:
obj=pd.Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [29]:
obj.index.is_unique

False

In [31]:
obj['a']

a    0
a    1
dtype: int64

In [33]:
obj['c']

4

In [34]:
df=pd.DataFrame(np.random.randn(4,3),index=['a','a','b','c'])
df

          0         1         2
a  0.283500 -1.238123  0.517202
a  0.550060  0.809132 -0.458611
b -0.214362 -0.170033  1.010694
c -0.224530 -1.829304  0.485539

In [36]:
df.loc['b']

0   -0.214362
1   -0.170033
2    1.010694
Name: b, dtype: float64

In [38]:
df.loc['c']

0   -0.224530
1   -1.829304
2    0.485539
Name: c, dtype: float64

In [40]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan, np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [42]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [44]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [47]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [49]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [51]:
df.mean(axis='columns',skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [53]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [56]:
obj = pd.Series(['a','a','b','c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [59]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [62]:
obj = pd.Series(['c','a','d','a','a','a','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    a
6    b
7    c
8    c
dtype: object

In [64]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [67]:
obj.value_counts()

a    4
c    3
d    1
b    1
dtype: int64

In [69]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [71]:
obj[mask]

0    c
6    b
7    c
8    c
dtype: object

In [73]:
pd.value_counts(obj.values,sort=False)

c    3
a    4
d    1
b    1
dtype: int64

In [ ]:
price = pd